app/Http/Controllers/Admin/Auth/RegisteredUserController.php

    public function store(Request $request)
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:admins'],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        Auth::guard('admin')->login($user = Admin::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]));
---
insert into `admins` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('test', 'test@test', '$2y$10$IPrfOka3MaKJzi3.tsT3YOrGNjxU2Ow03qnjyzr/kCoZixB2/bxii', '2024-05-25 07:30:46', '2024-05-25 07:30:46')