app/Http/Controllers/Admin/OwnersController.php

    public function index()
    {
        $date_now = Carbon::now();
        $date_parse = Carbon::parse(now());
        echo $date_now->year;
        echo $date_parse;
        $e_all = Owner::all();
---
select * from `owners`