app/Http/Controllers/Admin/OwnersController.php

select `name`, `email`, `created_at` from `owners`
---
    public function index()
    {
        // $date_now = Carbon::now();
        // $date_parse = Carbon::parse(now());
        // echo $date_now->year;
        // echo $date_parse;
        // $e_all = Owner::all();
        // $q_get = DB::table('owners')->select('name', 'created_at')->get();
        // $q_first = DB::table('owners')->select('name')->first();


        // $c_test = collect([
            // 'name' => 'てすと'
        // ]);

        // var_dump($q_first);
        // dd($e_all, $q_get, $q_first, $c_test);
        $owners = Owner::select('name', 'email', 'created_at')->get();

insert into `owners` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('test3', 'test3@test', '$2y$10$wCo2Vz5JgsUm/Vixe5vzeuT/alg5goInUwC8yzDHC0EOV6gFTxc8e', '2024-06-02 14:05:08', '2024-06-02 14:05:08')
---
    public function store(Request $request)
    {
        //$request->name;
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:owners'],
            'password' => ['required', 'confirmed', 'min:8'],
        ]);

        Owner::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);